app/controllers/api/meals_controller.rb

SELECT "meals".* FROM "meals"
---
    def index
        @meals = Meal.all

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @meal = Meal.includes(ingredients: {photo_attachment: :blob} ).find_by(id: params[:id])