app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "phone_number", "email", "country", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"